# библиотеки
import turtle
import time
import random

#---------------------экран----------------------
# создание экрана
screen = turtle.Screen()
# размер экрана
screen.setup(650, 650)
# название игры
screen.title('Змейка 2077')
# меняет цвет фона
screen.bgcolor('#31F3FF')
#---------------------экран----------------------

#--------------------змейка----------------------
snake=turtle.Turtle()
snake.shape('square')
#--------------------змейка----------------------

#--------------------управление------------------
# угол, клавиша
screen.onkeypress(lambda: snake.setheading(90), 'Up')

screen.listen()
#--------------------управление------------------

#--------------------игра------------------------
while True:
    # скорость змейки
    snake.forward(3)
    
    # обновление экрана
    screen.update()

